[{"id": 2082, "page": null, "title": null, "commentary": "Maybe I'l come back to the issue of why Sollux is reminiscent of Dave later. I feel like there's more to say there. It touches on a broader issue of personality construction in Homestuck overall, which utilizes certain traits as almost elemental, platonic psychological and behavioral forms to build more extensive and widely varied profile composites. It's an approach that resonates with the rest of Homestuck's governing principles involving simple platonic concepts giving rise to greater complexity and chaos. The Alpha Kid personalities in Act 6 are a much clearer demonstration of this principle as applied to character personas. This really is a whole can of worms, though, Let's open a can of grubs instead. Why are video games contained within living grubs, which you must puncture with wires to play? Because  everything about troll culture is a bit gross, weird, and stupid. That's why.\n\nTerezi says it's weird that Sollux types in yucky mustard, even though his \"favorite colors\" are red and blue. It's really not weird at all, considering literally everyone in his blood class types in that color. But this idea may not have been fully locked in yet as an ironclad canon fact. While Hivebent continuously provides the scoop on  What tha fare af this a dmiltanaanely avnlarian rasain nahiifane iHase hatira filly mammittina 6A tham: This is a vary aand whan it mamas           ba aoa\n\nThere's an awful lot going on up here too. Many points of lore and prophecy to earmark for later validation by the story. All of it does come to pass, in some way or another. The blindness, the dying twice stuff... Angels turn out to just be flying white monster things that either emerge from, or are composed of, the fearsome force of hope. That sounds kind of meaningless, and maybe it is, but that's what they are. Also, Terezi asking \"how does it know which angel to use...\" is a pretty confusing line without context. It's just a reference to a Sweet Bro comic, where he wonders what angle to use. I'm not sure a lot of these Sweet Bro and Hella Jeff funny quote shout-outs really hold up. The whole work seems much more detached from the Sweet Bro canon than it used to be. And littering this story with such quotes has  simply resulted in the future burden of me having to explain them down here in the gutter when they happen, so y'all aren't too confused. Do you actually appreciate this??? I have my doubts.", "notes": null}]