[{"id": 2144, "page": null, "title": null, "commentary": "Aradia and Vriska have a pretty interesting thing going on with each other, which is easy to forget since they don't have much to do with each other after Hivebent. Which is understandable, since they mostly work out their issues at the end of the arc. (I.e. Vriska gets beaten senseless. Let that be a lesson to anyone at a loss for how to handle their Serket problems. The way Vriska behaves toward Aradia says a lot about Vriska. These earlier interactions between them do a lot to establish the finer points of who she is beyond simply being the Huge Bitch of the group. She's fairly obsequious toward Aradia. She looks for approval, she makes appeals to be her equal despite their class disparity, to be \"co-leaders\", to bond over sticking it to Sollux,... Basically to FORCE friendship. Why is she acting like this? Not suprisngly there are a bunch of layers to her psychology. Hey, let's keep talking about this over here. -->\n\n\--> Vriska references the Team Charge Deb8cle, which we later learn resulted in Aradia's death. It's pretty evident that it's mostly Vriska's guilt driving this conversation. Guilt, plus an overbearing need to make things square and thus fully \"erase\" the misdeeds of the past. She talks about a gift she has in store, only from her, no one else. (She \"commissions\" Equius to make Aradia a robot body, wants all the credit for the favor, and has no concern for the fact that he may have his own agenda for doing this. Of her many irons in the fire, some tend to be outsourced like this. In her self-obsession, she demands full credit nonetheless and expects to maximize the return on the investment she didn't even make, which is full amnesty for her past crimes.) Everything about what's happening here is wildly overcompensatory, meant to repair damage she's done without really having to face what it is she actually did. Aradia's extremely passive nature as a ghost makes her an easy target for this kind of overbearing attention. Because what Vriska seems to want most is acknowledgement, and more importantly, to foster strong reactions. Good or bad, love or hatred, this seems to be what she demands from everyone. -->", "notes": null}]
