[{"id": 2146, "page": null, "title": null, "commentary": "--> So for that reason, Aradia's impassivity seems to add fuel to Vriska's sycophantic need to make amends. Not caring much one way or another about what Vriska does is guaranteed to drive Vriska crazy. Neutrality is insufferable to her because it makes her feel irrelevant. Being irrelevant is her biggest fear and ultimate enemy. She struggles to keep herself in the spotlight, and when the narrative is finally done with her and tosses her into the gutter, she fights her way back into relevance. Fighting against the forces of narrative marginalization completely define her entire batshit arc, from her introduction here all the way to the end of Homestuck. So Aradia's listless attitude is the perfect foil for revealing this about her. It drives her nuts, and later she has a meltdown about it. She won't be done with Aradia until there is a catharsis between them that's up to her standards. In that sense, by finally beating Vriska to a pulp, Aradia is actually sort of doing her a favor.\n\nI am going to call bullshit on Sollux being confused by the caste system. There are only two colors lower than his, brown and burgundy, belonging to Tavros and Aradia. Since class is so important in troll culture, if you're in a friend group, you're probably acutely aware at all times of which ones are lower than you, and which ones are higher. I think what he means here (or, rather, what I mean) about the caste system being confusing is that the reader is the one who doesn't know much about it  yet. We're still in the process of learning that there even is a caste system. By asking this fairly disingenuous question \"what? worze than yellow?\" Sollux is actually informing the reader in a very concrete way that 1) there is definitely a caste system based on blood color, and 2) some colors are worse than yellow and some better. A perceptive reader will probably have already surmised that the castes simply follow the rainbow order that we've seen them arranged by in the Trollian user list already.", "notes": null}]