[{"id": 2162, "page": null, "title": null, "commentary": "of moirallegiance by troll standards. This is a minor point, though. For reasons that are hard to explain, this relationship is of cosmic significance in the grand scheme of the narrative. Arquius x Davepeta, as the terminal for their combined trajectory, illustrates its significance by seemingly placing it on near-equivalent terms with Dave and Dirk's relationship. Why the hell should this be true? Perhaps it's premature to say. I'll save that for the Act 6 book babbling. More generally, key relationship pairs bring a lot out of certain characters, even minor ones. For instance, you could write dozens of paragraphs of meta on Vriska alone. But the moment you stop writing about Vriska in a vacuum, and start writing about Vriska x Terezi, the avenues of analysis seem endless. It's a circuitous, psychologically tortured mutual are of competitive codependency, which on closer inspection serves as the axis around which virtually the entire plot revolves. Equius and Nepeta bring things out of  each other's arcs in a similar way, relative to their lesser roles in the story. They could have ended up being merely two fairly shallow extras swallowed up by a huge ensemble, but the interactions they have make it much harder to write off either of them individually.\n\nBut wait, there's more. He also sweats a lot, he can't actually wield a bow and arrow because he's too strong and just breaks them, and he detests cruelty to animals, which he adores, especially humongous, nude, anthropomorphic beasts, which is something we don't need to get into now. There's plenty to say about Nepeta too, but when they're talking, it seems Equius starts to bury her in the contest of absurd, eyebrow-raising character traits. In this sense, she's sort of the straight man of the duo's relationship. But then, that's not a bad way to describe what a moirail really is. It's playing the stable, calming straight man to a more erratic or extreme personality, to help keep them grounded.", "notes": null}]