[{"id": 2178, "page": null, "title": null, "commentary": "Homestuck s narrative fext-which you may nave guessed is indistinguishab'e from my Stream-ol-consciousness in virtually any context, including these notes-bears examination sometimes. It contains many statements that aren't jokes exactly, just wise-assed things to say, as well as ways of saying things that could be said in a more sensible manner. Like, \"But not too far into the present.\" What the hell does this actually mean? We're hopping back to the \"present,\" but not so far back that we would have to officially begin calling it the future. In fact, going \"far into the present\" seems to be a preposterous concept, because the present is an  exact point on a timeline. Falling short of the present, by a bit or a lot, is what we call the past. Exceeding it by a bit or a lot is what we call the future. Also none of this means anything, because Hivebent has made it pretty clear through its nonlinear presentation that there's no such thing as the present from our viewpoint. And to make this even less meaningful, no matter how far into Hivebent's \"future\" you go, it's still all taking place in the past, since it's explicitly presented as a long flashback in the greater story. The narration is always playing games with words to evocatively capture this stupid dance we're doing with ludicrous ideas and abstract concepts.\n\nThis appears to be the only time in the story Vriska psychically controls Karkat. There are definitely limitations to her powers. Higher bloods are immune. Everyone from Terezi and up can resist her powers. Probably Kanaya too, since it's hard to imagine her being controlled. (Though whether that's due to her blood or temperament is an open question.) Trolls lower on the hemospectrum are fair game. Tavros, Sollux...probably Nepeta too, but why would Vriska bother with her? Aradia has some resistance due to being an advanced psychic herself, in a way that Sollux is not at his lower moments (see: brain problems). So, is Vriska being truthful that she can control Karkat but just doesn't want to because his mind is unpalatable? Or is there something about his mind that makes it genuinely difficult to control, and that's just her cover story? Maybe all she can pull off are these little things. \"Finger slips\" as little demonstrations of power, without being able to take full control.", "notes": null}]