[{"id": 2221, "page": null, "title": null, "commentary": "Equius thrashes between ordering people what to do, and then when they do it, becoming dissatisfied and realizing that he really wants them to be doing what he wants them to do under their own volition, and also for them to tell HIM what to do, whether they're of a higher or lower caste. This is a mess, and is probably why these two talk so much. It's an endlessly circular fetish, and it never resolves itself. Timeline-wise, this conversation locates them after Gamzee has entered the game. The red team has a good jump on the blue team, already three players deep while the first blue (Equius) hasn't entered yet. Not a super important detail, but it's worth tracking this stuff in the background somewhat, because the order of entry tells us certain things, like who had to work with (or put up with) whom as a server player. Karkat deals with Terezi (we saw how that went), Terezi deals with Gamzee (notable when you know their long-range arc), Gamzee deals with Tavros (thank god for offscreen conversations, let's just leave it at that), Tavros deals with Vriska (Oh No), and Vriska deals with Kanaya (mom to the rescue).\n\nEquius has a quirk with a fair amount to consider. As the Sagittarius, and therefore centaur-themed troll, the \"cent\" part of centaur makes 100 his magic number and percent signs his favored symbol. He replaces the phoneme \"loo\" in words with \"100,\" even when the original word isn't spelled that way, like \"b100.\" And he swaps in % signs for x's, but more confusingly, also for x phonemes, so \"bricks\" becomes \"bri%.\" He does this even for sounds that are just close to x, like \"distinction\" becoming \"distin%ion.\" And sometimes he replaces an entire word semantically related to the % symbol, like \"cross.\" I ended up really milking this quirk, mostly because I knew that only swapping instances of x would not yield a lot of changes and so would feel kind of insubstantial.", "notes": null}]