[{"id": 2222, "page": null, "title": null, "commentary": "Having just revealed his feelings toward Aradia at the end of the last conversation to Gamzee (and us), referring to his \"pact\" with her, we are finally picking up on their double-cross (%%) arrangement. Recall that it was left ambiguous in a scene with Aradia who she was referencing as co-leader, whether it was Vriska or a different blue-blooded troll. They all seem to think they're playing each other. Equius is probably the closest to being right. Notice how Equius knows exactly what he's doing here, at every step of the way. When he says \"I'll deliver it shortly,\" he doesn't say who he's delivering it to. He's playing Vriska, and he thinks he's playing  Aradia by giving her a body he's \"tampered\" with. But Aradia outplays him on that front in the end too.\n\nOf course, the fact is that everyone's playing everyone else, and all involved know what a bunch of backstabbing assholes they all are, so attempts to follow through with planned collusion sort of devolve into this slapstick banter where they clearly seem to suspect they're all about to double-cross each other. This is also another look at the Obsequious Vriska persona, who rears her head with anyone who is notably aloof, harsh, or disdainful to her regularly. It makes sense that this has become the standard repartee between them over the years. Equius's personality is pretty stable, but hers is in wild flux depending on who she's talking to. A Paradox Space comic I wrote shows off this dynamic pretty well too, where she sucks up to him after her arm got blown off, hoping he'd build a new one for her. On this note, there's also decent supporting evidence that Vriska has some sort of crush on Equius, but possibly only on a physical basis. Maybe the best case for this is how she went gaga when she saw Nic Cage from Con Air, with his sweaty muscles, long greasy hair, and dirty wifebeater. She absolutely lost it, and Equius looks exactly the fucking same. So,  while she may not \"like\" him technically, in a personal way, her crush is the kind where she finds some dude so outrageously and inexplicably hot, he completely ruins har ahilitv ta aan cnmnnaiira ar think ratinnallv Which mav avnlain why ha was abla ta nlay har an ancily", "notes": null}]