[{"id": 2244, "page": null, "title": null, "commentary": "to nudge people in the direction of doing the nasty thing that, deep down, they already know they want to do. Like any self-respecting devil figure would. A couple pages ago, you might have noticed Terezi and Aradia alluding to his presence, when Tavros was in the process of jumping off the cliff. He asked them for help, but they didn't answer. The reason apparently was that Doc was distracting them, to ensure Vriska had the time to get the job done. It also seems likely he egged her on too, given what he's about to say to her here. Maybe he'd been inflaming her contempt for Tavros leading up to that moment as well? Whispering things in her ear about what a loser he is, how he'll never become strong without her \"help.\" He'd surely know just what buttons to push.\n\nin the story who can speak to and influence other characters in support of an evil agenda, (That is, the summoning of yet another, even more satanic alt-author being into the comic.) Viewed this way, his conversations with other characters take on a different quality. Normally, the author remains a disguised presence and influences the thoughts of characters with an unseen hand, simply by writing their thoughts directly into their heads, their words into their mouths. This alt-author is essentially doing the same thing, but as an actual character and a known presence to those he influences. He whispers in their ears, gets them to do the nasty, terrible things  that are latent within their nature to do, which I as the unseen author easily could have done myself through a conventional writing process. But I outsourced that dark influence to this guy, thus establishing him as a narrative construct in the story on the same level as, but at odds with, the actual author. This surreptitiously lays the groundwork for a future point of tension: a narrative war between an Idiot God and a Genius Devil. Which, admittedly, when the shit finally hits the fan, mostly reads as one buffoon's struggle with a figment of his imagination, in the form of a wrestling match with a floppy, inanimate puppet. It's actually the perfect metaphor signifying  the creative process behind this comic.", "notes": null}]