[{"id": 2495, "page": null, "title": null, "commentary": "'The problem is that when the subject f trol romance is broached, our sparing human intalecs instanty assume the mont ingraaing posture of surender imaginable, Bet we wil do our bes to understand regardtes, Humans have only one arm of romance; And though we consider ia compleate aubjec, spanning a wide renge of emotions, sol convention, and malcatons for reproduction, itis ulimataly a superfialsiee of what rolls consider the fullbody of romantic experience, Our concent of romance, in ake ofits capacty t il our art and Iterture ard to rile ou ndivdul destinies Hike tte alse is tl Just that, A single, Inan concent. A concent unvaly denoted by a single symbol. <3 Trll romance is more complicate than that, Tra romance needs four symbols. Thar understanding of romance is dvded nto halves, and halved again, producing four quadrants te FLUSHED GUADRANT, the QxAORANT the PALE GURDRANT, and the ASHER cach aadrant is grouped by the hall they share, whether horzontaly or vericaly, depending on the overiaaing properties one examines. The sharpest dichotomy, from an emotional perspective, is drawn between RED ROMANCE and BLAK RORICE, RED ROMANCE, comprised of the fushed and pale quadrants, isa form of romance rted n strangly postive emotion. BLACK ROMANCE, wth ts calgnous and ashen quadrants i rooted in th strongly negative. On the other han, the vericl furcation ha todo wth the purpose o th relatensti, regardless ofthe emotions behind t. Those quadrants which are CONCUPISCENT; the flushed and calginous, have to do wth facitatng the eltrorate reproductive eye of rls Those which are CONCILLATORY, the pale and ashen, would be more closely ikened t platonic relationships by haman standards. There are many paralels between human relationships and the varous facts of ral romance. Humans have words to describe relatonstip o a negative nature, or o a latonc nature The iference is or humans, those relationships would neve be concestualy grouped with ramanoe,Establsing those sort of relatonstip or humans is no driven by thesame primal forces that dive our tendency to couple romantically. But for trols, hose prmal fares involve themselves nthe fal palette of thse relatonstip,red or black, torid or Trls lady fee strongly compiled t fnd balance in ach quadrant, and seak graiyingrelaionaips that each describes 'The challenge is articlat tortuous for young troll, uh must reconcle the wide range of contradictory emotions assoclated wth this matri, whle understanding the nature of thar various romantic urges for the rst ime. Of cours, young humans have this challenge to, But for trols, the chalenge is fourfls When two intilals ind themselves n the Alushed eundrant together, they are said to he MATESPRITS, Hatespnisia s the closest paralel to the human concent of romance rats have. it lays a role in the rls reproductive cycle, Jus as t does for humans. Ths is prety civious! ot much mare needs to be said about thi. Moving right along. When a al f adversaries delve nto tis quadrant they become ench other' KISMESTS, s one of the concuplscent quadrants, t plays a role in procreation as wel. Thee is no  good human translation fo this concent. The closet would be an especialy potent art- vay For instance, human players would never beable to adequately diagnose the relationship between the aueen and her archagent; ut trl players could imrmedately lice it as a How of L vane erd nite dine de war a i e ne cance ol G na t avea nou oen read acta erode can no reer € ine aun Tora cloe S Eaton catia cover an cmd\n\neee ee tenant tva and going on. Being contised by trol relatonshis is one thing we do have n common thaugh, Ths quadrant resides over HOIRALLRGIENCE; th other conclatoy relationship. A reasonable human transistion woul be the concent ofa soul mate, but in a more platonic sense and wth a more specite sel purpose. Trols are a vey angry and vielen race: Seme are more ho tempered and dangerous than others o th exten that if le to thar onn devices, they would present a serous treat to soc or evento Such trie wil have an instncuve pole attraction to a more even-tempered tral, who may become thar MOIRATL The malrl s obliged to oly the other to function as the better half The two partners in a strony pale relaionhin wil serve to balance and complement each others emotional profiles, and thas alow tha other relatonstips tobe mare suecessl It cten amicus especialy among young trols whether a bond formed between an acauaintance is true mir legence, or the usual varity f latoni involvement; Furthermore, romantic intentions of a more Aashed nature can often be mistaken for pier leanings, much o the fratration o the suter. Bat some pale palings, as the one above, wil b sling obvious to ll who know them, Gad you Just can't at enough of hs can you! That would have been a great pin fora tration out of this iustated std, but ol, if you inin, Now see, hat's going on her is.. It' pefect sinse, When the ful matic of rll romance is in acton, we have.. ut. ey, why don't you Aure it out! You should be an exper on al ths by now anyway. ater our tral hero would ty to explain th t our human her, attempting t convey allthe nuance of trl romance through a nearly versam rectain o the preceing excet. o would tyto descr haw rich and textured the rll romane comedies were compared tothe one tmersanal sciock of car human cinemati conternacs. He would barely sertch the surface o Tol Wil Smeh's vituaity wth the decat atice of rll romance, as he would anis the buring fudgebioadd Tral Kevin James through the nternsven mine rarpatch f redrom and backrom entanglements ll the whie siting through his oun pricy romant situation and mately earing the rue meaning of hate and pty. But would they succeed before the imperil drone came knocking wth hi thirsty pals at th ready??? Yes, they would. ut John dnt understand any of this because he' a moron, and he wouldnt shut up about his awl bls Eath movies, He would ust go on and an and on about tht aartage Su if there was one theme t be hammered through his thick sul, t wouldbe te role culural preacupation wih romantic destin: Yes, the romant landscape is rte wit false star and imieies and infdlies, red and black, Sut every rol bleves strongly that each auadrant helds one and only one rue alig fr them, and tis use a matter of me before the nd i led wh aunicous matchups though the mysterious channels of TROLL SERENDIPITY. In shor, thr baie is that fo each undrant there exist a piro iad of rals somenher n the that were... MADE For EAcH omen.", "notes": null}]