[{"id": 2543, "page": null, "title": null, "commentary": "The introduction of \"memos\" as a new dialogue medium was a pretty exciting addition to the overall toolkit of character interaction. Mainly because it was the first venue that allowed for more than just two people to talk to each other at once. The result is the feeling of a messy chat room, rather than a direct message conversation. Except even messier, because this is where the characters begin to play around with the feature that lets them talk to each other across different points on the timeline. The net result of this, mostly, is just Karkat creating an almost infinite supply of new, self-fulfilling ways of owning himself in front of all his friends. This device was a great device to throw into the mix of later Act 5 action. Many good things were done with it, and it really shook the story out of some overly comfortable patterns of character interplay. I give it five stars. I mean, I give everything I do five stars. But this time, I give five stars to this particular five-star rating.\n\nFive hours from when Karkat types this, he's looking at dead Sollux on his monitor and probably remembering this memo exchange. Which, according to the laws of sadstuck, just makes the death all the more tragic. He thought Sollux was joking, then blocked him. Karkat seems to have a habit of doing this. Recall that he did basically the same thing when Tavros messaged him to tell him he was just paralyzed. There's kind of a sad conflict in Karkat's personality, where he genuinely cares deeply for all his friends but is so busy and so caught up in his own bullshit all the time that he obliviously glides right over the moments where they're actually in serious trouble.\n\nEquius says \"here in the future, this bulletin has come to be regarded as something of a joke,\" even though he's only six hours into Karkat's future while reading this.  I guess a born snob will use literally any point of superiority to be snobby with. Blood color, being a few hours in the future, whatever, His observation is worth a laugh, but really, what he probably means is, he scrolled way ahead to see the future of the memo and has observed how many people in the memo mock him for it. He's already identifying more with people from weeks ahead in the timeline than with Karkat, who's only a few hours behind, just for the sake of giving him a hard time.  In fact, even Karkat starts doing this to himself. Maybe more than anyone else.", "notes": null}]