[{"id": 2547, "page": null, "title": null, "commentary": "Terezi's side of this chalk conversation speaks pretty well for itself. Sometimes good conversations are just implied ones. It seems that the Black Queen may be assisting with her own Regisurp-exiling process? Or maybe, more accurately, with foreknowledge of her inevitable exiling, she's using her understanding of what  happened to give even more instructions, to achieve something else she wants. Such as exiling the agents who betrayed her. Oh, there's another retcon oil splotch there on the crabtop. I haven't been pointing them out much. Maybe I don't want to spoil all the fun for you? (It's not even that fun.)\n\nThe timeline diagram up there is really intense. Take a look at the gray bars and note how high they come up. That shows when each player entered the session. Karkat first, then Terezi, so they're the lowest (so low, they're below the edge of the window). From Karkat's (CCG's) current frame of reference, everyone but Sollux, Eridan, and Feferi have entered. I can ALMOST guarantee that all of those bar heights were carefully considered so as not to produce continuity snags. I remember making these little memo Trollian diagrams as if the slightest error by even a pixel width was an unconscionable act of carelessness. The character dot-markers are all pretty  well-placed too. Shouldn't I be winning some sort of award for this shit? The award they give guys who discover the most innovative and perplexing ways to waste their time. That's the one I want, give it to me.\n\nListen. That just HAPPENED to be the three letter abbreviation for Future arachnidsGrip, okay? It's not like I specifically went out of my way to make this word appear on this page a whole bunch of times. Karkat simply offers some metacommentary on the word, because it kind of jumps out, doesn't it? What, are you going to sit there and tell me that you would have made the choice not to bring anyone's attention to it at ALL? Oh, what's that you say, smart guy? You probably wouldn't have even made Homestuck in the first place? Well aren't YOU special then. Anyway, Karkat wraps it up with some words to live by: \"OK T'M RAMBLING HERE, TM AWARE OF THAT.\" I'm copying this statement here as a reminder to get these words tattooed on myself some day.\n\nRarkat is far from being a master of time. !f anything, he may actually be sort of a numbskull with regard to the aspect. But since he's charging blind'y into this mad quest which by its nature involves so many time shenanigans, it kind of forces him to be introspective and sometimes actually a bit insightful about the nature of time. He has to think about what the future really means. It's \"kind of a wide open thing,\" happening in a few years or a few minutes. When you start seeing future versions of other people and yourself as legitimately different, discretely isolated personas, it conjures certain philosophical problems, which he's constantly grappling with. The further the future is from the present, the more distinct that separate version of a person is. Ideas like this, and Karkat's unabashed floundering with them, start threading into bigger themes of the story, such as, what is a person, and what constitutes the \"self\"? Is it an ideal? A composite of ideals? The result of a composite of ideals and a set of specific choices? Clearer understanding of a single aspect, Time, actually starts deepening one's understanding of the concept of self. Does greater understanding of other aspects allow this as well? The story answers this later on.", "notes": null}]