[{"id": 2567, "page": null, "title": null, "commentary": "Here's another non-reveal reveal like disguising Karkat's blood color while showing it, kind of a cheating way of hiding but not hiding something. I didn't feel like it was the right time to show the second word of Kanaya's land yet, because it's a word shared with all Space players' lands, including Jade's. There were various reasons I didn't want to tip off the name of her land, but also, garbling the text signals to the reader that this information is a mystery worth taking note of. Aside from that, let's enjoy the fact that Kanaya dragged all her nice pillows up to the edge of this volcano so she could be comfy while computing.\n\n\"IT TURNS OUT YOU CAN'T ALTER THE OUTCOME OF DECISIONS MADE BY MORONS, NO MATTER HOW MUCH YOU YELL AT THEM.\" Not to get overly political down here in the laugh gutter. This just sounds like the tagline for the result of the 2016 U.S. election.\n\nThis is also the first time in Hivebent when we spend any real time tuning into a part that takes place on the meteor they end up stranded on after whatever catastrophe causes them to flee there. For all the zipping up and down the timeline we do, we never actually go that far until now. Again, it's about starting to gather up and  organize all these loose threads and direct them back into something we recognize as connecting to the main narrative line. Even when certain stories or arcs are really chaotic and wildly out of order, I think most of us have good intuitions when it comes to picking up on when a story is making moves in preparation for the approach to its own endgame material. This memo starts feeling like that turning point. You've also got Kanaya weighing in, playing the role of a sort of wise, sympathetic ear to a down-and-out protagonist. You know That Moment in the movie. We all do. We're all experts. Homestuck knows you're a media expert and uses that assumption to its\n\nKarkat mentions here an \"invisible riddler.\" This is an idea that comes up from time to time throughout the story. Recall the \"unseen riddle\" in the narration during John's early animation, when he's listening to the wind in his neighborhood. It conjures the idea of a hidden Loki-like figure somewhere, whose pranks have nihilistic designs, an intangible force of mischief that robs its targets of a meaningful or dignified existence. In John's case, the nihilistic rumination about this figure seems to focus on the shapeless and uncertain direction of his life. Karkat's remark here focuses on the futility and self-fulfiliment of one's own foolishness, passively allowed to play itself out by this prankster figure, who he links to \"Father Time\" as well. There is no one true god of Paradox Space, but to whatever extent there is, it's probably this riddler figure, which is why it's left in doubt as to whether he even exists at all. He's never discussed without also referencing his invisibility, or dubious reality. A much less cagey explanation is, it's probably best interpreted as the forces of mischief and authorial cruelty or callousness toward the subjects within this fiction, which are laced into the entire narrative and relate closely to the quality of \"authorial scorn\" that was mentioned earlier in some of the Vriska meta. When galvanized through mara avtrama finras lia Faliharn - thase fares harnma jace nageivaly and nranketary \"and mara artivaly hnetila and Aastnirtive\n\nKarkat's dissertation on magic is a pretty good summary of the ongoing tension between the realness/fakeness attribute of magic throughout the story. We get pretty flippant about magic in Homestuck, don't we? It's just a word you can use to describe certain forces, in the same way that you can use the word \"luck\" to evaluate certain outcomes, if you're fixated on that concept. This isn't really mind-blowing wisdom here. I'd describe it more as premise-level information, upon which the story elaborates in certain ways. Magic and luck are more like states of mind. If there is any deeper truth to sift from these semantics, it's an idea that the story keeps returning to, which is that the power of belief is the key to everything. Believing in things reduces their fakeness attribute. It's the force that shapes your reality, used to snatch personal meaning from the jaws of a cynical and nihilistic environment. Could this be why Hope is framed as the most fundamentally powerful aspect? Even the other aspects themselves are ideas like this (recall: luck=light), whose power is subject to the ebb and flow of one's belief in them. And belief itself isn't necessarily just a trick of willpower. It can be an expression of one's willingness to embrace an idea, or pursue a deeper understanding of it.", "notes": null}]