[{"id": 2578, "page": null, "title": null, "commentary": "This SBAH]J-style comic \"reskinned\" from earlier iteration, involving Davesprite flying up away to the sun like a fucking piece of gargbage, was a good, stupid panel to puase on while I took a few days to make [S] Make her pay. Wow, a few WHOLE DAYS? \"Pausing\" the comic formally used to be necessary in such situations because it updated so much, and during Hivebent in particular. A pause page was a way of me saying, \"Chill out, I'm not dead, I'm probably just working on a Flash.\" Later on, the pauses got a little less \"fun,\" and also a lot longer. It was more like me saying, \"Yo guys, chill here for a bit while I take a moment to handle a multi- year spanning crisis.\" Usually those long gaps were radically overcompensated for by killing all the characters in one fell swoop upon my return and dumping a ton  of horribly drawn anime on everyone. In a way, all Homestuck pauses can be seen as a means of storing up vast quantities of dark potential energy, which explodes in everyone's face when the updates resume.\n\n\n\nIf it wasn't totally clear, here's what Vriska did. She psychically controls Tavros, who's a total chump and is easy for her to control at any time, for any purpose. She makes him use his psychic powers to commune with an animal. The animal in question is Terezi's pre-hatched dragon, who is psychically linked to Terezi, who is asleep. The dragon then controls Terezi to get up, sleepwalk through the woods, and stare directly into the harsh Alternian sun until she goes blind. Pretty good revenge, Vriska. I'm impressed. Or I would be, if I wasn't the one who thought of it instead of you. Oh wait, that just makes me even more impressed with it. Good job all around, everyone. Me and my OCs make a great team.\n\nThey open their eyes in both places. Dream Terezi sees Skaia, real Terezi gets an eyeful of burning sun. This is what causes Terezi to wake up on Prospit. She's blind in both the real and dream worlds, but now that her dragon is in tune with her mind, she's taught how to see in other ways, making most use of those lessons on Prospit. By the time she wakes up back in the woods to discover herself blind, she can already \"see\" well enough to find her way back home. Her blinding isn't really  the maiming Vriska was going for. It's a sense-expanding, mind-awakening event that Terezi feels improves her life, and it becomes an important part of her identity. So much so that to be \"healed\" would trigger a crisis of identity and depression.\n\nAradiabot shows up to beat Vriska's ass down. And we see she's got two portable, floating time-travel devices, like Dave has. These are implied to be akin to his turntables, but they're made from the stuff she had available on her planet. So this shot establishes that she's been making the rounds through time. Doing what, though? We'll see. But whatever she did, it seems like she's done enough of it to decide it's squared away, and she's now at liberty to focus on settling an old score.\n\nThe animation settles into a rhythm from here on, in a way that I think is pretty self-explanatory, even in static form. So there's probably not much to say about it. I think I'm going to try a brand-new trick. It's called \"hiding the author notes margin\" when I don't have anything particularly worthwhile to say. Oh, you don't think that sounds like the \"coolest\" idea I've ever had? Well, why don't you give it a shot first, see how you feel about it. I know I'm feeling pretty great about the plan already.\n\nAnd we see this is the story of how Vriska awakened on Prospit too. You can look at the animation as telling as two parallel tales, in two different ways. Either as two tales of revenge revolving around Vriska, one where she delivers retribution and the other where she receives it. Or as two tales of awakening, one where Terezi wakes  up in response to making the best of a punishment she probably didn't deserve, and the other where Vriska wakes up in response to being jolted from slumber by a punishment she probably did deserve.\n\nAnother observation: Vriska's dream self is healed, arm and eye intact. Terezi's is still blind though. There are some vague and unspoken rules concerning whether serious injuries transfer over to dream selves. A decent way of viewing a dream self is just as a dream-projection of the id. A collection of certain ideas about yourself, your identity. Vriska's injuries aren't an important part of who she is, and if they were healed, she'd be glad to be done with them. Terezi's blindness is a big part of her  identity. In fact, she was blinded by the very process of her awakening, which, if you ask me, is a more than logical way of understanding how the injury was imprinted on her dream self for good.", "notes": null}]