[{"id": 2604, "page": null, "title": null, "commentary": "mmm SLL Aradia's SOULBOT VIDEO LOG is essentially the same feature that Jade's dreambot has. Might as well use it as another in-story medium to broadcast certain events. The wrap-up of all this stuff, as seen and described by Aradia, really was the right way to go, since she did the most to launch the session and knows the most about what's going on. Nevertheless, despite her quite expansive field of situational knowledge, she still manages to play the role of an unreliable narrator here in a bunch of ways. Turning people who know huge amounts of stuff into unreliable narrators is both good as a challenge for the author, and good as a strategy for toying with  the perception of readers and keeping them off guard. The more you establish the narrator as credible, the likelier a reader is to believe the things they say, and if you thread some disinformation into their accounts, it provides fuel later for more credible surprises. Jade's character is also being used in this way.\n\nThis is actually one long image. On the site, you scroll down and down, to get to one line of dialogue, which lends a certain measure of impact. Here, I have pulled the dazzling media trick of converting vertical, digital scrolling motion into horizontal, paper-based page-turning motion. Pretty cool, isn't it?\n\nJust kidding, it's not cool at all. This is a very tall image, and there's almost literally no other way to deal with that as a formatting challenge other than what has been done here. Thanks for checking out my tall-ass, de-animated animated GIF in the form of print media, though. I appreciate it.\n\nThe black field dissolved into this crackling field of green energy. You can't see it, but I could describe it to you? Well, I couldn't really, any more than I just did. Maybe I could make some sound effects? That would definitely come across as a nice value-add to the book presentation of this story.\n\nCRAKCLEFWOOOSHHHHHH-CRACKZAP-BZZTCH-(FLAME ROAR, SMOLDER)-PCHOOWHOSO0OOSH-CRACKEREL-ZAAAAP-yeah this fuckin sucks.", "notes": null}]